package com.zzc.commons;
/**
 * 异常代码
 * 1开头表示成功
 * 2开头表示请求方错误
 * 3开头表示服务器错误
 */
public enum ErrorCode {
    CODE_100(100, "请求成功"),
    CODE_101(101, "操作成功。但是你所绑定的机器人未在线。"),
    
    CODE_200(200, "请求错误"),
    CODE_201(201, "缺少必要参数"),
    CODE_202(202, "请求方法不对"),
    CODE_203(203, "mac地址已存在，保存失败"),
    CODE_204(204, "serialNo已存在，保存失败"),
    CODE_205(205, "该用户没用绑定机器人"),
    CODE_206(206, "不是正确的手机号"),
    CODE_207(207, "用户名已被注册"),
    CODE_208(208, "不是正确的邮箱号"),
    CODE_209(209, "邮箱号已被注册"),
    CODE_210(210, "用户名或密码错误"),
    CODE_211(211, "验证码错误"),
    CODE_212(212, "token不正确或已过期，请重新登录"),
    CODE_213(213, "机器人没有在线"),
    CODE_214(214, "未知project"),
    CODE_215(215, "未知设备类型"),
    CODE_216(216, "该机器人已经被别人绑定了"),
    CODE_217(217, "你不能申请与自己成为好友"),
    CODE_218(218, "不存在此用户"),
    CODE_219(219, "两次请求验证码时间不能短于30s"),
    CODE_220(220, "该用户绑定的机器人不在线"),
    CODE_221(221, "没有在openfire请求方与被请求方找到相关记录"),
    CODE_222(222, "该账户下没有这个角色id"),
    CODE_223(223, "不存在这个角色id"),
    CODE_224(224, "未知商品类型commodityType"),
    CODE_225(225, "未知商品"),
    CODE_226(226, "askJid或recvJid已存在，已取消保存"),
    CODE_227(227, "宠物名请使用汉字、英文字母、阿拉伯数字、下划线，且字符数不小于2个，不大于8个"),
    CODE_228(228, "该宠物名已被注册"),
    CODE_229(229, "该用户已经有宠物人"),
    CODE_230(230, "sign不正确"),
    CODE_231(231, "该用户已超过最大闹钟限制。"),
    CODE_232(232, "该用户下不存在这个闹钟。"),
    CODE_233(233, "该用户没有宠物。"),
    CODE_234(234, "不存在该任务。"),
    CODE_235(235, "该用户下不存在这个提醒。"),
    CODE_236(236, "没有这个宠物装饰物。"),
    CODE_237(237, "宠物等级不够，无法购买该装饰物。"),
    CODE_238(238, "金币不足。"),
    CODE_239(239, "已经购买了该物品了。"),
    CODE_240(240, "密码不符合规范。长度6-16个字符"),
    CODE_241(241, "该手机号尚未注册"),
    CODE_242(242, "原始密码不正确"),
    CODE_243(243, "帐户没有绑定机器人或没有激活机器人"),
    CODE_244(244, "未找到记录"),
    CODE_245(245, "操作失败。消息未送达机器端。可能原因：1、机器人没在线 2、服务器内部调用错误"),
    CODE_246(246, "该机器未绑定账号"),
    CODE_247(247, "可能原因：1、你要修改的账号绑定机器人不存在 2、你没有权限修改别人的机器人  3、操作曾经已解绑的记录"),
    CODE_248(248, "绑定机器人失败，请输入有效的SN号"),
    CODE_249(249, "已经存在的闹钟"),
    
    CODE_300(300, "系统错误"),
    
    // 11XX 客户端主动发起请求
    CODE_1101(1101, "请求登陆"),
    CODE_1102(1102, "心跳"),
    CODE_1103(1103, "获取绑定账户的token"),
    
    // 12XX 服务器回复请求
    CODE_1201(1201, "缺少必要参数"),
    CODE_1202(1202, "回复心跳"),
    CODE_1203(1203, "登陆成功"),
    CODE_1204(1204, "该机器人还未绑定账户"),
    CODE_1205(1205, "获取token成功"),
    
    // 13XX 服务器主动发起请求
    CODE_1300(1300, ""),
    CODE_1310(1310, "好友申请"),
    CODE_1311(1311, "更新闹钟"),
    CODE_1312(1312, "更新提醒"),
    CODE_1313(1313, "绑定机器人成功"),
    CODE_1314(1314, "解绑绑定机器人"),
    CODE_1315(1315, "请登录或重新登录"),
    
    // 14XX 客户端回复请求
    CODE_1400(1400, ""),
    
    // 15XX 服务器错误
    CODE_1500(1500, "服务器错误");
    
    
    private int code;
    private String desc;
    
    ErrorCode (int code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }   
}
